Repository: ctheune/assembly-cms
Catalog: src/asm/summer12/locales/*/LC_MESSAGES/asm.winter12.po
Languages: fi

source: What's happening?
fi: Nyt tapahtuu

source: Current
fi: Nyt menossa

source: ends ${time}
fi: loppuu ${time}

source: Upcoming
fi: Tulevat

source: begins ${time}
fi: alkaa ${time}

source: Game Tournaments
fi: Peli turnaukset

source: feedback
fi: palaute

source: privacy
fi: yksityisyydensuoja

source: contact
fi: yhteystiedot

source: Copyright &copy; ${asmorglink}, 2009-2011
fi: &copy; ${asmorglink}, 2009-2011

source: Buy Tickets
fi: Osta liput

source: Reserve your tickets!
fi: Varaa liput!

source: Buy Tickets!
fi: Osta liput!

source: Sponsors
fi: Sponsorit

source: Associates
fi: Yhteistyökumppanit

source: Main sponsors
fi: Pääsponsorit

source: seconds
fi: sekuntia

source: minutes
fi: minuuttia

source: Welcome to Assembly!
fi: Tervetuloa ASSEMBLYille!

source: until ASSEMBLY!
fi: ASSEMBLYn alkuun!

source: of ASSEMBLY left to enjoy!
fi: ASSEMBLYjä jäljellä.

source: ASSEMBLY is over.
fi: ASSEMBLY on ohi.

source: years
fi: vuotta

source: months
fi: kuukautta

source: hours
fi: tuntia

source: days
fi: päivää
