Repository: ctheune/assembly-cms
Catalog: extensions/asm.schedule/src/asm/schedule/locales/*/LC_MESSAGES/asm.schedule.po
Languages: fi

source: Tuesday
fi: Tiistai

source: Wednesday
fi: Keskiviikko

source: Thursday
fi: Torstai

source: Friday
fi: Perjantai

source: Saturday
fi: Lauantai

source: Sunday
fi: Sunnuntai

# Monday(until)
source: Monday
fi: maanantaihin

# Tuesday(until)
source: Tuesday
fi: tiistaihin

# Wednesday(until)
source: Wednesday
fi: keskiviikkoon

# Thursday(until)
source: Thursday
fi: torstaihin

# Friday(until)
source: Friday
fi: perjantaihin

# Saturday(until)
source: Saturday
fi: lauantaihin

# Sunday(until)
source: Sunday
fi: sunnuntaihin

source: Monday
fi: Maanantai

source: All
fi: Kaikki

source: Major
fi: Merkittävät

source: Compos
fi: Kilpailut

# event_until_line
source: &ndash; until ${hour} ${day}
fi: &ndash; ${day} klo. ${hour} asti
